HIIMOHIMOHIMO/STM32F3_HAL_Projects/get3EncoderVal_sendRS485/Src/main.c
  sMasterConfig.MasterOutputTrigger = TIM_TRGO_RESET;
  sMasterConfig.MasterOutputTrigger2 = TIM_TRGO2_RESET;
  sMasterConfig.MasterSlaveMode = TIM_MASTERSLAVEMODE_DISABLE;
  if (HAL_TIMEx_MasterConfigSynchronization(&htim1, &sMasterConfig) != HAL_OK)
  {
    Error_Handler();
  }

}

/* TIM2 init function */
static void MX_TIM2_Init(void)
{

  TIM_Encoder_InitTypeDef sConfig;
  TIM_MasterConfigTypeDef sMasterConfig;

  htim2.Instance = TIM2;
  htim2.Init.Prescaler = 0;
  htim2.Init.CounterMode = TIM_COUNTERMODE_UP;
  htim2.Init.Period = 65535;
  htim2.Init.ClockDivision = TIM_CLOCKDIVISION_DIV1;
  sConfig.EncoderMode = TIM_ENCODERMODE_TI12;
  sConfig.IC1Polarity = TIM_ICPOLARITY_RISING;
  sConfig.IC1Selection = TIM_ICSELECTION_DIRECTTI;
  sConfig.IC1Prescaler = TIM_ICPSC_DIV1;
  sConfig.IC1Filter = 0;
  sConfig.IC2Polarity = TIM_ICPOLARITY_RISING;
  sConfig.IC2Selection = TIM_ICSELECTION_DIRECTTI;
  sConfig.IC2Prescaler = TIM_ICPSC_DIV1;
  sConfig.IC2Filter = 0;
  if (HAL_TIM_Encoder_Init(&htim2, &sConfig) != HAL_OK)
  {
    Error_Handler();
  }

  sMasterConfig.MasterOutputTrigger = TIM_TRGO_RESET;
  sMasterConfig.MasterSlaveMode = TIM_MASTERSLAVEMODE_DISABLE;
  if (HAL_TIMEx_MasterConfigSynchronization(&htim2, &sMasterConfig) != HAL_OK)
  {
    Error_Handler();
  }

}

/* TIM3 init function */
static void MX_TIM3_Init(void)
{

  TIM_Encoder_InitTypeDef sConfig;
  TIM_MasterConfigTypeDef sMasterConfig;

  htim3.Instance = TIM3;
  htim3.Init.Prescaler = 0;
  htim3.Init.CounterMode = TIM_COUNTERMODE_UP;
  htim3.Init.Period = 65535;
  htim3.Init.ClockDivision = TIM_CLOCKDIVISION_DIV1;
  sConfig.EncoderMode = TIM_ENCODERMODE_TI12;
  sConfig.IC1Polarity = TIM_ICPOLARITY_RISING;
  sConfig.IC1Selection = TIM_ICSELECTION_DIRECTTI;
  sConfig.IC1Prescaler = TIM_ICPSC_DIV1;
  sConfig.IC1Filter = 0;
  sConfig.IC2Polarity = TIM_ICPOLARITY_RISING;
  sConfig.IC2Selection = TIM_ICSELECTION_DIRECTTI;
  sConfig.IC2Prescaler = TIM_ICPSC_DIV1;
  sConfig.IC2Filter = 0;
  if (HAL_TIM_Encoder_Init(&htim3, &sConfig) != HAL_OK)
  {
    Error_Handler();
  }

  sMasterConfig.MasterOutputTrigger = TIM_TRGO_RESET;
  sMasterConfig.MasterSlaveMode = TIM_MASTERSLAVEMODE_DISABLE;
  if (HAL_TIMEx_MasterConfigSynchronization(&htim3, &sMasterConfig) != HAL_OK)
  {
    Error_Handler();
  }

}

/* USART2 init function */
static void MX_USART2_UART_Init(void)
{

  huart2.Instance = USART2;
  huart2.Init.BaudRate = 115200;
  huart2.Init.WordLength = UART_WORDLENGTH_8B;
  huart2.Init.StopBits = UART_STOPBITS_1;
  huart2.Init.Parity = UART_PARITY_NONE;
  huart2.Init.Mode = UART_MODE_TX_RX;
  huart2.Init.HwFlowCtl = UART_HWCONTROL_NONE;
  huart2.Init.OverSampling = UART_OVERSAMPLING_16;
  huart2.Init.OneBitSampling = UART_ONE_BIT_SAMPLE_DISABLE;
  huart2.AdvancedInit.AdvFeatureInit = UART_ADVFEATURE_NO_INIT;
  if (HAL_UART_Init(&huart2) != HAL_OK)
  {
    Error_Handler();
  }

}

/** Configure pins as 
        * Analog 
        * Input 
        * Output
        * EVENT_OUT
        * EXTI
*/
static void MX_GPIO_Init(void)
{

  GPIO_InitTypeDef GPIO_InitStruct;

  /* GPIO Ports Clock Enable */
  __HAL_RCC_GPIOF_CLK_ENABLE();
  __HAL_RCC_GPIOA_CLK_ENABLE();
  __HAL_RCC_GPIOB_CLK_ENABLE();

  /*Configure GPIO pin Output Level */
  HAL_GPIO_WritePin(StateLED_GPIO_Port, StateLED_Pin, GPIO_PIN_RESET);

  /*Configure GPIO pin Output Level */
  HAL_GPIO_WritePin(GPIOA, REDE_Pin|LED0_Pin|B7_Pin|B6_Pin 
                          |B5_Pin, GPIO_PIN_RESET);

  /*Configure GPIO pin Output Level */
  HAL_GPIO_WritePin(GPIOB, LED1_Pin|LED2_Pin|B4_Pin|B3_Pin 
                          |B2_Pin|B1_Pin|B0_Pin, GPIO_PIN_RESET);

  /*Configure GPIO pin : StateLED_Pin */
  GPIO_InitStruct.Pin = StateLED_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
  HAL_GPIO_Init(StateLED_GPIO_Port, &GPIO_InitStruct);

  /*Configure GPIO pin : Bit1_state_Pin */
  GPIO_InitStruct.Pin = Bit1_state_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_INPUT;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  HAL_GPIO_Init(Bit1_state_GPIO_Port, &GPIO_InitStruct);

  /*Configure GPIO pins : REDE_Pin LED0_Pin B7_Pin B6_Pin 
                           B5_Pin */
  GPIO_InitStruct.Pin = REDE_Pin|LED0_Pin|B7_Pin|B6_Pin 
                          |B5_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
  HAL_GPIO_Init(GPIOA, &GPIO_InitStruct);

  /*Configure GPIO pins : LED1_Pin LED2_Pin B4_Pin B3_Pin 
                           B2_Pin B1_Pin B0_Pin */
  GPIO_InitStruct.Pin = LED1_Pin|LED2_Pin|B4_Pin|B3_Pin 
                          |B2_Pin|B1_Pin|B0_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
  HAL_GPIO_Init(GPIOB, &GPIO_InitStruct);

  /*Configure GPIO pin : Bit2_state_Pin */
  GPIO_InitStruct.Pin = Bit2_state_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_INPUT;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  HAL_GPIO_Init(Bit2_state_GPIO_Port, &GPIO_InitStruct);

}

/* USER CODE BEGIN 4 */
/*--- Encoder ---*/
void Encoder_Read_Strat(){
	HAL_TIM_Encoder_Start(&htim1,TIM_CHANNEL_ALL);
	HAL_TIM_Encoder_Start(&htim2,TIM_CHANNEL_ALL);
	HAL_TIM_Encoder_Start(&htim3,TIM_CHANNEL_ALL);
}
void Encoder_Read_Stop(){
	HAL_TIM_Encoder_Stop(&htim1,TIM_CHANNEL_ALL);
	HAL_TIM_Encoder_Stop(&htim2,TIM_CHANNEL_ALL);
	HAL_TIM_Encoder_Stop(&htim3,TIM_CHANNEL_ALL);
}
int getTIM1Enc(){
	return TIM1->CNT;
}
int getTIM2Enc(){
	return TIM2->CNT;
}
int getTIM3Enc(){
	return TIM3->CNT;
}
int isChange(int old,int new){
	if(old != new){
		return true;
	}else{
		return false;
	}
}
/*--- UART ---*/
void sendData(uint16_t *Data){
	int i;
	uint8_t TxData[10];
	uint8_t CheckSum = 0;
	TxData[0] = '#';
	TxData[1] = 0xEE;
	TxData[2] = 0x06;
	TxData[3] = ((Data[0]>>0)&0xFF);
	TxData[4] = ((Data[0]>>8)&0xFF);
	TxData[5] = ((Data[1]>>0)&0xFF);
	TxData[6] = ((Data[1]>>8)&0xFF);
	TxData[7] = ((Data[2]>>0)&0xFF);
	TxData[8] = ((Data[2]>>8)&0xFF);
	for(i=0; i<9; i++){
		CheckSum = CheckSum ^ TxData[i];
	}
	TxData[9] = CheckSum;
	REDEOn();
	HAL_UART_Transmit_IT(&huart2,TxData,10);
	HAL_Delay(3);
	REDEOff();
	stateLED(2);
}
void REDEOn(){
	HAL_GPIO_WritePin(REDE_GPIO_Port,REDE_Pin,GPIO_PIN_SET);
}
void REDEOff(){
	HAL_GPIO_WritePin(REDE_GPIO_Port,REDE_Pin,GPIO_PIN_RESET);
}
/*--- Interrupt ---*/
void HAL_UART_TxCpltCallback(UART_HandleTypeDef *UartHandle){}
void HAL_UART_RxCpltCallback(UART_HandleTypeDef *UartHandle)
{
  HAL_UART_Receive_IT(&huart2, &RxData, 1);
	uint8_t Data = RxData;
	if(_index != 0){
		RxBuff[_index-1] = Data;
		_index++;
		if(_index == 5){
			_index = 0;
			if(RxBuff[0]==0xEE && RxBuff[1]==0x01){
//				sendData(databuf);
			}
		}
	}else
	if(Data == 0x23){
		_index = 1;
	}
}
void waitRxInterrupt(){
	while(1){
		if(RxBuff[0] == 0xEE && RxBuff[1]==0x01)break;
	}
}
/*--- LED ---*/
void stateLED(int State){
	if(State == 1){
		HAL_GPIO_WritePin(StateLED_GPIO_Port,StateLED_Pin,GPIO_PIN_SET);
	}else
	if(State == 0){
		HAL_GPIO_WritePin(StateLED_GPIO_Port,StateLED_Pin,GPIO_PIN_RESET);
	}else
	{
		HAL_GPIO_TogglePin(StateLED_GPIO_Port,StateLED_Pin);
	}
}
void Led0On(){
	HAL_GPIO_WritePin(LED0_GPIO_Port,LED0_Pin,GPIO_PIN_SET);
}
void Led1On(){
	HAL_GPIO_WritePin(LED1_GPIO_Port,LED1_Pin,GPIO_PIN_SET);
}
void Led2On(){
	HAL_GPIO_WritePin(LED2_GPIO_Port,LED2_Pin,GPIO_PIN_SET);
}
void Led0Off(){
	HAL_GPIO_WritePin(LED0_GPIO_Port,LED0_Pin,GPIO_PIN_RESET);
}
void Led1Off(){
	HAL_GPIO_WritePin(LED1_GPIO_Port,LED1_Pin,GPIO_PIN_RESET);
}
void Led2Off(){
	HAL_GPIO_WritePin(LED2_GPIO_Port,LED2_Pin,GPIO_PIN_RESET);
}
void Led0Toggle(){
	HAL_GPIO_TogglePin(LED0_GPIO_Port,LED0_Pin);
}
void Led1Toggle(){
	HAL_GPIO_TogglePin(LED1_GPIO_Port,LED1_Pin);
}
void Led2Toggle(){
	HAL_GPIO_TogglePin(LED2_GPIO_Port,LED2_Pin);
}
/*--- JP ---*/
int Bit1_state(){
	return HAL_GPIO_ReadPin(Bit1_state_GPIO_Port,Bit1_state_Pin);
}
int Bit2_state(){
	return HAL_GPIO_ReadPin(Bit2_state_GPIO_Port,Bit2_state_Pin);
}
/*--- out cnt ---*/
void output_cntled(){
	int bit1_st = Bit1_state();
	int bit2_st = Bit2_state();
	if( bit1_st == 0 && bit2_st == 1 ){
		if((databuf[0]&0x01) != 0)HAL_GPIO_WritePin(B0_GPIO_Port,B0_Pin,GPIO_PIN_SET);
		else HAL_GPIO_WritePin(B0_GPIO_Port,B0_Pin,GPIO_PIN_RESET);
		if((databuf[0]&0x02) != 0)HAL_GPIO_WritePin(B1_GPIO_Port,B1_Pin,GPIO_PIN_SET);
		else HAL_GPIO_WritePin(B1_GPIO_Port,B1_Pin,GPIO_PIN_RESET);
		if((databuf[0]&0x04) != 0)HAL_GPIO_WritePin(B2_GPIO_Port,B2_Pin,GPIO_PIN_SET);
		else HAL_GPIO_WritePin(B2_GPIO_Port,B2_Pin,GPIO_PIN_RESET);
		if((databuf[0]&0x08) != 0)HAL_GPIO_WritePin(B3_GPIO_Port,B3_Pin,GPIO_PIN_SET);
		else HAL_GPIO_WritePin(B3_GPIO_Port,B3_Pin,GPIO_PIN_RESET);
		if((databuf[0]&0x10) != 0)HAL_GPIO_WritePin(B4_GPIO_Port,B4_Pin,GPIO_PIN_SET);
		else HAL_GPIO_WritePin(B4_GPIO_Port,B4_Pin,GPIO_PIN_RESET);
		if((databuf[0]&0x20) != 0)HAL_GPIO_WritePin(B5_GPIO_Port,B5_Pin,GPIO_PIN_SET);
		else HAL_GPIO_WritePin(B5_GPIO_Port,B5_Pin,GPIO_PIN_RESET);
		if((databuf[0]&0x40) != 0)HAL_GPIO_WritePin(B6_GPIO_Port,B6_Pin,GPIO_PIN_SET);
		else HAL_GPIO_WritePin(B6_GPIO_Port,B6_Pin,GPIO_PIN_RESET);
		if((databuf[0]&0x80) != 0)HAL_GPIO_WritePin(B7_GPIO_Port,B7_Pin,GPIO_PIN_SET);
		else HAL_GPIO_WritePin(B7_GPIO_Port,B7_Pin,GPIO_PIN_RESET);
	}else 
	if( bit1_st == 1 && bit2_st == 0 ){
		if((databuf[1]&0x01) != 0)HAL_GPIO_WritePin(B0_GPIO_Port,B0_Pin,GPIO_PIN_SET);
		else HAL_GPIO_WritePin(B0_GPIO_Port,B0_Pin,GPIO_PIN_RESET);
		if((databuf[1]&0x02) != 0)HAL_GPIO_WritePin(B1_GPIO_Port,B1_Pin,GPIO_PIN_SET);
		else HAL_GPIO_WritePin(B1_GPIO_Port,B1_Pin,GPIO_PIN_RESET);
		if((databuf[1]&0x04) != 0)HAL_GPIO_WritePin(B2_GPIO_Port,B2_Pin,GPIO_PIN_SET);
		else HAL_GPIO_WritePin(B2_GPIO_Port,B2_Pin,GPIO_PIN_RESET);
		if((databuf[1]&0x08) != 0)HAL_GPIO_WritePin(B3_GPIO_Port,B3_Pin,GPIO_PIN_SET);
		else HAL_GPIO_WritePin(B3_GPIO_Port,B3_Pin,GPIO_PIN_RESET);
		if((databuf[1]&0x10) != 0)HAL_GPIO_WritePin(B4_GPIO_Port,B4_Pin,GPIO_PIN_SET);
		else HAL_GPIO_WritePin(B4_GPIO_Port,B4_Pin,GPIO_PIN_RESET);
		if((databuf[1]&0x20) != 0)HAL_GPIO_WritePin(B5_GPIO_Port,B5_Pin,GPIO_PIN_SET);
		else HAL_GPIO_WritePin(B5_GPIO_Port,B5_Pin,GPIO_PIN_RESET);
		if((databuf[1]&0x40) != 0)HAL_GPIO_WritePin(B6_GPIO_Port,B6_Pin,GPIO_PIN_SET);
		else HAL_GPIO_WritePin(B6_GPIO_Port,B6_Pin,GPIO_PIN_RESET);

		if((databuf[1]&0x80) != 0)HAL_GPIO_WritePin(B7_GPIO_Port,B7_Pin,GPIO_PIN_SET);
		else HAL_GPIO_WritePin(B7_GPIO_Port,B7_Pin,GPIO_PIN_RESET);
	}else
	if( bit1_st == 0 && bit2_st ==0  ){

		if((databuf[2]&0x01) != 0)HAL_GPIO_WritePin(B0_GPIO_Port,B0_Pin,GPIO_PIN_SET);
		else HAL_GPIO_WritePin(B0_GPIO_Port,B0_Pin,GPIO_PIN_RESET);
		if((databuf[2]&0x02) != 0)HAL_GPIO_WritePin(B1_GPIO_Port,B1_Pin,GPIO_PIN_SET);
		else HAL_GPIO_WritePin(B1_GPIO_Port,B1_Pin,GPIO_PIN_RESET);

		if((databuf[2]&0x04) != 0)HAL_GPIO_WritePin(B2_GPIO_Port,B2_Pin,GPIO_PIN_SET);
		else HAL_GPIO_WritePin(B2_GPIO_Port,B2_Pin,GPIO_PIN_RESET);
		if((databuf[2]&0x08) != 0)HAL_GPIO_WritePin(B3_GPIO_Port,B3_Pin,GPIO_PIN_SET);
		else HAL_GPIO_WritePin(B3_GPIO_Port,B3_Pin,GPIO_PIN_RESET);

