HIIMOHIMOHIMO/STM32F3_HAL_Projects/get3EncoderVal_sendRS485/Src/main.c
		if((databuf[2]&0x10) != 0)HAL_GPIO_WritePin(B4_GPIO_Port,B4_Pin,GPIO_PIN_SET);
		else HAL_GPIO_WritePin(B4_GPIO_Port,B4_Pin,GPIO_PIN_RESET);
		if((databuf[2]&0x20) != 0)HAL_GPIO_WritePin(B5_GPIO_Port,B5_Pin,GPIO_PIN_SET);
		else HAL_GPIO_WritePin(B5_GPIO_Port,B5_Pin,GPIO_PIN_RESET);
		if((databuf[2]&0x40) != 0)HAL_GPIO_WritePin(B6_GPIO_Port,B6_Pin,GPIO_PIN_SET);

		else HAL_GPIO_WritePin(B6_GPIO_Port,B6_Pin,GPIO_PIN_RESET);
		if((databuf[2]&0x80) != 0)HAL_GPIO_WritePin(B7_GPIO_Port,B7_Pin,GPIO_PIN_SET);
		else HAL_GPIO_WritePin(B7_GPIO_Port,B7_Pin,GPIO_PIN_RESET);
	}

}
/*
void output_cntled(){
	int bit1_st = Bit1_state();
	int bit2_st = Bit2_state();
	if( bit1_st == 0 && bit2_st == 1 ){
		if((databuf[0]&0x0100) != 0)HAL_GPIO_WritePin(B0_GPIO_Port,B0_Pin,GPIO_PIN_SET);
		else HAL_GPIO_WritePin(B0_GPIO_Port,B0_Pin,GPIO_PIN_RESET);
		if((databuf[0]&0x0200) != 0)HAL_GPIO_WritePin(B1_GPIO_Port,B1_Pin,GPIO_PIN_SET);
		else HAL_GPIO_WritePin(B1_GPIO_Port,B1_Pin,GPIO_PIN_RESET);
		if((databuf[0]&0x0400) != 0)HAL_GPIO_WritePin(B2_GPIO_Port,B2_Pin,GPIO_PIN_SET);
		else HAL_GPIO_WritePin(B2_GPIO_Port,B2_Pin,GPIO_PIN_RESET);
		if((databuf[0]&0x0800) != 0)HAL_GPIO_WritePin(B3_GPIO_Port,B3_Pin,GPIO_PIN_SET);
		else HAL_GPIO_WritePin(B3_GPIO_Port,B3_Pin,GPIO_PIN_RESET);
		if((databuf[0]&0x1000) != 0)HAL_GPIO_WritePin(B4_GPIO_Port,B4_Pin,GPIO_PIN_SET);
		else HAL_GPIO_WritePin(B4_GPIO_Port,B4_Pin,GPIO_PIN_RESET);
		if((databuf[0]&0x2000) != 0)HAL_GPIO_WritePin(B5_GPIO_Port,B5_Pin,GPIO_PIN_SET);
		else HAL_GPIO_WritePin(B5_GPIO_Port,B5_Pin,GPIO_PIN_RESET);
		if((databuf[0]&0x4000) != 0)HAL_GPIO_WritePin(B6_GPIO_Port,B6_Pin,GPIO_PIN_SET);
		else HAL_GPIO_WritePin(B6_GPIO_Port,B6_Pin,GPIO_PIN_RESET);
		if((databuf[0]&0x8000) != 0)HAL_GPIO_WritePin(B7_GPIO_Port,B7_Pin,GPIO_PIN_SET);
		else HAL_GPIO_WritePin(B7_GPIO_Port,B7_Pin,GPIO_PIN_RESET);
	}else 
	if( bit1_st == 1 && bit2_st == 0 ){
		if((databuf[1]&0x0100) != 0)HAL_GPIO_WritePin(B0_GPIO_Port,B0_Pin,GPIO_PIN_SET);
		else HAL_GPIO_WritePin(B0_GPIO_Port,B0_Pin,GPIO_PIN_RESET);
		if((databuf[1]&0x0200) != 0)HAL_GPIO_WritePin(B1_GPIO_Port,B1_Pin,GPIO_PIN_SET);
		else HAL_GPIO_WritePin(B1_GPIO_Port,B1_Pin,GPIO_PIN_RESET);
		if((databuf[1]&0x0400) != 0)HAL_GPIO_WritePin(B2_GPIO_Port,B2_Pin,GPIO_PIN_SET);
		else HAL_GPIO_WritePin(B2_GPIO_Port,B2_Pin,GPIO_PIN_RESET);
		if((databuf[1]&0x0800) != 0)HAL_GPIO_WritePin(B3_GPIO_Port,B3_Pin,GPIO_PIN_SET);
		else HAL_GPIO_WritePin(B3_GPIO_Port,B3_Pin,GPIO_PIN_RESET);
		if((databuf[1]&0x1000) != 0)HAL_GPIO_WritePin(B4_GPIO_Port,B4_Pin,GPIO_PIN_SET);
		else HAL_GPIO_WritePin(B4_GPIO_Port,B4_Pin,GPIO_PIN_RESET);
		if((databuf[1]&0x2000) != 0)HAL_GPIO_WritePin(B5_GPIO_Port,B5_Pin,GPIO_PIN_SET);
		else HAL_GPIO_WritePin(B5_GPIO_Port,B5_Pin,GPIO_PIN_RESET);
		if((databuf[1]&0x4000) != 0)HAL_GPIO_WritePin(B6_GPIO_Port,B6_Pin,GPIO_PIN_SET);
		else HAL_GPIO_WritePin(B6_GPIO_Port,B6_Pin,GPIO_PIN_RESET);
		if((databuf[1]&0x8000) != 0)HAL_GPIO_WritePin(B7_GPIO_Port,B7_Pin,GPIO_PIN_SET);
		else HAL_GPIO_WritePin(B7_GPIO_Port,B7_Pin,GPIO_PIN_RESET);
	}else
	if( bit1_st == 0 && bit2_st ==0  ){
		if((databuf[2]&0x0100) != 0)HAL_GPIO_WritePin(B0_GPIO_Port,B0_Pin,GPIO_PIN_SET);
		else HAL_GPIO_WritePin(B0_GPIO_Port,B0_Pin,GPIO_PIN_RESET);
		if((databuf[2]&0x0200) != 0)HAL_GPIO_WritePin(B1_GPIO_Port,B1_Pin,GPIO_PIN_SET);
		else HAL_GPIO_WritePin(B1_GPIO_Port,B1_Pin,GPIO_PIN_RESET);
		if((databuf[2]&0x0400) != 0)HAL_GPIO_WritePin(B2_GPIO_Port,B2_Pin,GPIO_PIN_SET);
		else HAL_GPIO_WritePin(B2_GPIO_Port,B2_Pin,GPIO_PIN_RESET);
		if((databuf[2]&0x0800) != 0)HAL_GPIO_WritePin(B3_GPIO_Port,B3_Pin,GPIO_PIN_SET);
		else HAL_GPIO_WritePin(B3_GPIO_Port,B3_Pin,GPIO_PIN_RESET);
		if((databuf[2]&0x1000) != 0)HAL_GPIO_WritePin(B4_GPIO_Port,B4_Pin,GPIO_PIN_SET);
		else HAL_GPIO_WritePin(B4_GPIO_Port,B4_Pin,GPIO_PIN_RESET);
		if((databuf[2]&0x2000) != 0)HAL_GPIO_WritePin(B5_GPIO_Port,B5_Pin,GPIO_PIN_SET);
		else HAL_GPIO_WritePin(B5_GPIO_Port,B5_Pin,GPIO_PIN_RESET);
		if((databuf[2]&0x4000) != 0)HAL_GPIO_WritePin(B6_GPIO_Port,B6_Pin,GPIO_PIN_SET);
		else HAL_GPIO_WritePin(B6_GPIO_Port,B6_Pin,GPIO_PIN_RESET);
		if((databuf[2]&0x8000) != 0)HAL_GPIO_WritePin(B7_GPIO_Port,B7_Pin,GPIO_PIN_SET);
		else HAL_GPIO_WritePin(B7_GPIO_Port,B7_Pin,GPIO_PIN_RESET);
	}
}*/
/*---  ---*/
/* USER CODE END 4 */

/**
  * @brief  This function is executed in case of error occurrence.
  * @param  None
  * @retval None
  */
void Error_Handler(void)
{
  /* USER CODE BEGIN Error_Handler */
  /* User can add his own implementation to report the HAL error return state */
  while(1) 
  {
  }
  /* USER CODE END Error_Handler */ 
}

#ifdef USE_FULL_ASSERT

/**
   * @brief Reports the name of the source file and the source line number
   * where the assert_param error has occurred.
   * @param file: pointer to the source file name
   * @param line: assert_param error line source number
   * @retval None
   */
void assert_failed(uint8_t* file, uint32_t line)
{
  /* USER CODE BEGIN 6 */
  /* User can add his own implementation to report the file name and line number,
    ex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */
  /* USER CODE END 6 */

}

#endif

/**
  * @}
  */ 

/**
  * @}
*/ 

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
